model {
  ssd {
    num_classes: 1
    image_resizer {
      fixed_shape_resizer {
        height: 256
        width: 256
      }
    }
    feature_extractor {
      type: "ssd_mobilenet_v2_keras"
      depth_multiplier: 1.0
      min_depth: 16
      conv_hyperparams {
        regularizer {
          l2_regularizer {
            weight: 3.9999998989515007e-05
          }
        }
        initializer {
          truncated_normal_initializer {
            mean: 0.0
            stddev: 0.029999999329447746
          }
        }
        activation: RELU_6
        batch_norm {
          decay: 0.9700000286102295
          center: true
          scale: true
          epsilon: 0.0010000000474974513
          train: true
        }
      }
      override_base_feature_extractor_hyperparams: true
    }
    box_coder {
      faster_rcnn_box_coder {
        y_scale: 10.0
        x_scale: 10.0
        height_scale: 5.0
        width_scale: 5.0
      }
    }
    matcher {
      argmax_matcher {
        matched_threshold: 0.5
        unmatched_threshold: 0.5
        ignore_thresholds: false
        negatives_lower_than_unmatched: true
        force_match_for_each_row: true
        use_matmul_gather: true
      }
    }
    similarity_calculator {
      iou_similarity {
      }
    }
    box_predictor {
      convolutional_box_predictor {
        conv_hyperparams {
          regularizer {
            l2_regularizer {
              weight: 3.9999998989515007e-05
            }
          }
          initializer {
            random_normal_initializer {
              mean: 0.0
              stddev: 0.009999999776482582
            }
          }
          activation: RELU_6
          batch_norm {
            decay: 0.9700000286102295
            center: true
            scale: true
            epsilon: 0.0010000000474974513
            train: true
          }
        }
        min_depth: 0
        max_depth: 0
        num_layers_before_predictor: 0
        use_dropout: false
        dropout_keep_probability: 0.800000011920929
        kernel_size: 1
        box_code_size: 4
        apply_sigmoid_to_scores: false
        class_prediction_bias_init: -4.599999904632568
      }
    }
    anchor_generator {
      ssd_anchor_generator {
        num_layers: 6
        min_scale: 0.20000000298023224
        max_scale: 0.949999988079071
        aspect_ratios: 1.0
        aspect_ratios: 2.0
        aspect_ratios: 0.5
        aspect_ratios: 3.0
        aspect_ratios: 0.33329999446868896
      }
    }
    post_processing {
      batch_non_max_suppression {
        score_threshold: 9.99999993922529e-09
        iou_threshold: 0.6000000238418579
        max_detections_per_class: 100
        max_total_detections: 100
        use_static_shapes: false
      }
      score_converter: SIGMOID
    }
    normalize_loss_by_num_matches: true
    loss {
     classification_loss {
        weighted_sigmoid {
        }
      }
      localization_loss {
        weighted_smooth_l1 {
          delta: 1.0
        }
      }
      hard_example_miner {
          num_hard_examples: 3000
          iou_threshold: 0.99
          loss_type: CLASSIFICATION
          max_negatives_per_positive: 3
          min_negatives_per_image: 0
      }
      classification_weight: 1.0
      localization_weight: 1.0
    }
    encode_background_as_zeros: true
    normalize_loc_loss_by_codesize: true
    inplace_batchnorm_update: true
    freeze_batchnorm: false
  }
}

train_config {
  batch_size: 2
  data_augmentation_options {
    random_horizontal_flip {
    }
  }
  data_augmentation_options {
    ssd_random_crop {
    }
  }
  sync_replicas: true
  optimizer {
    rms_prop_optimizer {
      learning_rate {
        exponential_decay_learning_rate {
          initial_learning_rate: 0.003
          decay_steps: 2000
          decay_factor: 0.95
        }
      }
      momentum_optimizer_value: 0.9
      decay: 0.9
      epsilon: 1.0
    }
    use_moving_average: false
  }
  fine_tune_checkpoint: "pre-trained-models/ssd_mobilenet_v2_320x320_coco17_tpu-8/checkpoint/ckpt-0"
  startup_delay_steps: 0.0
  replicas_to_aggregate: 8
  max_number_of_boxes: 100
  num_steps: 50000
  unpad_groundtruth_tensors: false
  fine_tune_checkpoint_type: "detection"
  fine_tune_checkpoint_version: V2
}

train_input_reader {
  label_map_path: "annotations/EPFL_label_map.pbtxt"
  input_type: TF_SEQUENCE_EXAMPLE
  tf_record_input_reader {
    input_path: ["annotations/shards/train-EPFL-00.record","annotations/shards/train-EPFL-01.record",
		"annotations/shards/train-EPFL-02.record","annotations/shards/train-EPFL-03.record",
		"annotations/shards/train-EPFL-04.record","annotations/shards/train-EPFL-05.record",
		"annotations/shards/train-EPFL-06.record","annotations/shards/train-EPFL-07.record",
		"annotations/shards/train-EPFL-08.record","annotations/shards/train-EPFL-09.record",
		"annotations/shards/train-EPFL-10.record","annotations/shards/train-EPFL-11.record",
		"annotations/shards/train-EPFL-12.record","annotations/shards/train-EPFL-13.record",
		"annotations/shards/train-EPFL-14.record","annotations/shards/train-EPFL-15.record",
		"annotations/shards/train-EPFL-16.record","annotations/shards/train-EPFL-17.record",
		"annotations/shards/train-EPFL-18.record","annotations/shards/train-EPFL-19.record",
		"annotations/shards/train-EPFL-20.record","annotations/shards/train-EPFL-21.record",
		"annotations/shards/train-EPFL-22.record","annotations/shards/train-EPFL-23.record",
		"annotations/shards/train-EPFL-24.record","annotations/shards/train-EPFL-25.record",
		"annotations/shards/train-EPFL-26.record","annotations/shards/train-EPFL-27.record",
		"annotations/shards/train-EPFL-28.record","annotations/shards/train-EPFL-29.record"]
  }
}

eval_config {
  metrics_set: "coco_detection_metrics"
  use_moving_averages: false
  visualize_groundtruth_boxes: true
  groundtruth_box_visualization_color: "red"
}

eval_input_reader {
  label_map_path: "annotations/EPFL_label_map.pbtxt"
  shuffle: true
  num_epochs: 1
  input_type: TF_SEQUENCE_EXAMPLE
  tf_record_input_reader {
    input_path: "annotations/test-EPFL-0.record"
  }
}
